aaa-automation-tests/src/test/resources/uploadingfiles/xmlParser/QuickQuoteRequest_YesFlag.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
     <s:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken>
            <wsse:Username>soa_user</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">soa_user</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </s:Header>
   <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <RatePolicyRequest xmlns="http://exigenservices.com/ipb/policy/integration">
         <ApplicationContext>
            <userId xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">PLRATING</userId>
            <transactionType xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">DEV</transactionType>
            <application xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">PLRATING</application>
            <subSystem xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">PAS</subSystem>
            <address xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">addr</address>
            <correlationId xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">corID</correlationId>
         </ApplicationContext>
         <Policy>
        <Policy>
          <AAACSAAutoPolicy 
            xmlns="http://exigeninsurance.com/eis/product/schema/AAA_SS/1.0">
            <AAADriver oid="N61">
              <AAADriverRatingInfo>
                <drvrRejLimRightToSue>true</drvrRejLimRightToSue>
                <newDriverInd>false</newDriverInd>
                <smartDrCrsInd>false</smartDrCrsInd>
              </AAADriverRatingInfo>
              <AAADrivingLicense>
                <licensePermitNumber/>
                <licenseStatusCd>LICUS</licenseStatusCd>
                <stateProvCd>MD</stateProvCd>
              </AAADrivingLicense>
              <adbCoverageInd>false</adbCoverageInd>
              <age>57</age>
              <birthDate>1961-02-13T00:00:00</birthDate>
              <driverRelToApplicantCd>IN</driverRelToApplicantCd>
              <driverTypeCd>afr</driverTypeCd>
              <employeeBenefitType>NONE</employeeBenefitType>
              <financialResponsibilityInd>false</financialResponsibilityInd>
              <firstLicenseAge>16</firstLicenseAge>
              <firstName>Wesley</firstName>
              <genderCd>male</genderCd>
              <insuredOid>N15</insuredOid>
              <lastName>Finnigan</lastName>
              <maritalStatusCd>M</maritalStatusCd>
              <middleName></middleName>
              <occupationTypeCd>Employed</occupationTypeCd>
              <prefilled>true</prefilled>
              <specificDisabilityInd>false</specificDisabilityInd>
            </AAADriver>
            <AAAInsured oid="N15">
              <AAAInsuredPrimaryAddress>
                <addressLine1>11930 Acton Ln</addressLine1>
                <city>Waldorf</city>
                <countryCd>US</countryCd>
                <isAddressValidated>true</isAddressValidated>
                <postalCode>20601-3689</postalCode>
                <stateProvCd>MD</stateProvCd>
                <usageType>living</usageType>
              </AAAInsuredPrimaryAddress>
              <communicationInfo.email>johnsmith@example.com</communicationInfo.email>
              <communicationInfo.phoneNumber1>(555) 555-5555</communicationInfo.phoneNumber1>
              <dateOfBirth>1961-02-13T00:00:00</dateOfBirth>
              <firstName>Wesley</firstName>
              <insuredBaseDt>2018-05-01T00:00:00</insuredBaseDt>
              <lastName>Finnigan</lastName>
              <middleName></middleName>
              <principalRoleCd>policyHolder</principalRoleCd>
              <residentTypeCd>LIVPRT</residentTypeCd>
            </AAAInsured>
            <AAAPaymentOption>
              <paymentPlanCd>MonthlySS</paymentPlanCd>
            </AAAPaymentOption>
            <AAAMPCoverage>
              <limitAmount>0</limitAmount>
              <coverageCd>MEDPM</coverageCd>
            </AAAMPCoverage>
            <AAAPDCoverage>
              <limitAmount>100000</limitAmount>
              <coverageCd>PD</coverageCd>
            </AAAPDCoverage>
            <AAAUMBICoverage>
              <combinedLimitAmount>1000000/1000000</combinedLimitAmount>
              <coverageCd>UMBI</coverageCd>
            </AAAUMBICoverage>
            <AAAUMPDCoverage>
              <limitAmount>100000</limitAmount>
              <coverageCd>UMPD</coverageCd>
            </AAAUMPDCoverage>
            <AAAPIPCoverage>
              <coverageCd>PIP</coverageCd>
              <combinedLimitAmount>2501</combinedLimitAmount>
            </AAAPIPCoverage>
            <AAAVehicle oid="N100">
              <AAACOLLCoverage>
                <coverageCd>COLLDED</coverageCd>
                <deductibleAmount>500</deductibleAmount>
              </AAACOLLCoverage>
              <AAACOMPCoverage>
                <coverageCd>COMPDED</coverageCd>
                <deductibleAmount>500</deductibleAmount>
              </AAACOMPCoverage>
              <AAAGaragingAddress>
                <postalCode>20601-3689</postalCode>
                <residentialAddressInd>false</residentialAddressInd>
              </AAAGaragingAddress>
              <AAALoanLeaseCoverage>
                <limitAmount>0</limitAmount>
                <coverageCd>LOAN</coverageCd>
              </AAALoanLeaseCoverage>
              <AAARentalReimbursementCoverage>
                <combinedLimitAmount>30/900</combinedLimitAmount>
                <coverageCd>RREIM</coverageCd>
              </AAARentalReimbursementCoverage>
              <AAASpecialEquipmentCoverage>
                <limitAmount>1500</limitAmount>
                <coverageCd>SPECEQUIP</coverageCd>
              </AAASpecialEquipmentCoverage>
              <AAATowingAndLaborCoverage>
                <coverageCd>TOWINGLABOR</coverageCd>
                <combinedLimitAmount>0/0</combinedLimitAmount>
              </AAATowingAndLaborCoverage>
              <AAAVehicleCoveragePIP>
                <coverageCd>PIP</coverageCd>
                <combinedLimitAmount>2501</combinedLimitAmount>
              </AAAVehicleCoveragePIP>
              <AAAVehicleCoverageBI>
                <combinedLimitAmount>1000000/1000000</combinedLimitAmount>
                <coverageCd>BI</coverageCd>
              </AAAVehicleCoverageBI>
              <AAAVehicleCoverageMP>
                <coverageCd>MEDPM</coverageCd>
                <limitAmount>0</limitAmount>
              </AAAVehicleCoverageMP>
              <AAAVehicleCoveragePD>
                <coverageCd>PD</coverageCd>
                <limitAmount>100000</limitAmount>
              </AAAVehicleCoveragePD>
              <AAAVehicleCoverageUMBI>
                <combinedLimitAmount>1000000/1000000</combinedLimitAmount>
                <coverageCd>UMBI</coverageCd>
              </AAAVehicleCoverageUMBI>
              <AAAVehicleCoverageUMPD>
                <coverLevelCd>UMPD</coverLevelCd>
                <limitAmount>100000</limitAmount>
              </AAAVehicleCoverageUMPD>
              <AAAVehicleRatingInfo>
                <vehicleUsageCd>Pleasure</vehicleUsageCd>
                <fullGlassCoverageInd>false</fullGlassCoverageInd>
                <newCarProtectionInd>false</newCarProtectionInd>
              </AAAVehicleRatingInfo>
              <antitheft>NONE</antitheft>
              <ownershipTypeCd>OWN</ownershipTypeCd>
              <vehIdentificationNo>1G8AJ55F47Z150754</vehIdentificationNo>
              <vehTypeCd>PPA</vehTypeCd>
              <vinMatchedInd>true</vinMatchedInd>
            </AAAVehicle>
            <clubCd>212</clubCd>
            <BICoverage>
              <combinedLimitAmount>1000000/1000000</combinedLimitAmount>
              <coverageCd>BI</coverageCd>
            </BICoverage>
            <effective>2018-07-01T00:00:00</effective>
            <contractTermTypeCd>AN</contractTermTypeCd>
            <importedFrom>WMSB2C</importedFrom>
            <officeType>AZ Club Agent</officeType>
            <OtherOrPriorPolicy>
              <insurerCd>Pending</insurerCd>
              <insurerName>Finnigan</insurerName>
              <productCd>membership</productCd>
            </OtherOrPriorPolicy>
            <AAAOtherOrPriorPolicy>
              <continuousMonthsInsured>true</continuousMonthsInsured>
              <insurerCd>900</insurerCd>
              <insurerName> COMPANY99005         </insurerName>
              <monthsWithInsurer>26</monthsWithInsurer>
              <policyExpDate>2018-05-01T00:00:00</policyExpDate>
              <policyNumber>200809249900502803</policyNumber>
              <priorBILimits>1000000/1000000</priorBILimits>
            </AAAOtherOrPriorPolicy>
            <contractDisplay>12</contractDisplay>
            <productCd>AAA_SS</productCd>
            <riskStateCd>MD</riskStateCd>
            <subProducerCd>Online</subProducerCd>
            <leadSourceCd>19</leadSourceCd>
            <orderCreditScore>true</orderCreditScore>
			<enhancedUIM>true</enhancedUIM>
            <AAAPrefill>
              <firstName>WESLEY</firstName>
              <lastName>FINNIGAN</lastName>
              <birthDate>1961-02-13T00:00:00</birthDate>
              <riskStateCd>MD</riskStateCd>
              <AAAPrefillVehicle>
                <vehIdentificationNo>1G8AJ55F47Z150754</vehIdentificationNo>
                <modelYear>2007</modelYear>
                <manufacturer>SATURN</manufacturer>
                <model>ION</model>
              </AAAPrefillVehicle>
              <AAAPrefillVehicle>
                <vehIdentificationNo>1GTDC14Z5NZ519331</vehIdentificationNo>
                <modelYear>1992</modelYear>
                <manufacturer>GMC</manufacturer>
                <model>SIERRA</model>
              </AAAPrefillVehicle>
              <AAAPrefillDriver>
                <firstName>WESLEY</firstName>
                <lastName>FINNIGAN</lastName>
                <birthDate>1961-02-13T00:00:00</birthDate>
              </AAAPrefillDriver>
              <AAAPrefillDriver>
                <firstName>JOSEPH</firstName>
                <lastName>FINNIGAN</lastName>
              </AAAPrefillDriver>
              <AAAPrefillAddress>
                <postalCode>20601-3689</postalCode>
                <city>Waldorf</city>
                <addressLine>11930 Acton Ln</addressLine>
                <stateProvCd>MD</stateProvCd>
              </AAAPrefillAddress>
            </AAAPrefill>			
          </AAACSAAutoPolicy>
        </Policy>
      </Policy>
      </RatePolicyRequest>
   </s:Body>
</s:Envelope>